#Использовать asserts

Перем юТест;

// основной метод для тестирования
Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

	юТест = ЮнитТестирование;

	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_Сложить2Плюс2");

	Возврат ВсеТесты;

КонецФункции

Процедура ПередЗапускомТеста() Экспорт
	
	// Действия, выполняемые перед каждым запуском теста
	// Например инициализация окружения
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	// Действия, выполняемые после каждого запуска теста
	// Например удаление временных файлов
	
КонецПроцедуры

Процедура ТестДолжен_Сложить2Плюс2() Экспорт
	Утверждения.ПроверитьРавенство(4, 2 + 2, "2 + 2 = 4");
КонецПроцедуры
